[
  {
    "id": "andorians",
    "name": "Andorians",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "bajorans",
    "name": "Bajorans",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "betazoids",
    "name": "Betazoids",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "borg",
    "name": "Borg",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "cardassians",
    "name": "Cardassians",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "changelings",
    "name": "Changelings",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "ferengi",
    "name": "Ferengi",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "humans",
    "name": "Humans",
    "type": "Warp-capable humanoid species",
    "quadrant": "Alpha Quadrant (Sol system, Sector 001)",
    "homeworld": "Earth (Sol system)",
    "affiliations": [
      "United Earth (World Government)",
      "United Federation of Planets (founding member world: Earth)",
      "Starfleet (human-majority service; Earth-origin organization)"
    ],
    "firstAppearance": "TOS: \"The Man Trap\" (first aired); TOS pilot: \"The Cage\"",
    "overview": "Humans (Homo sapiens), sometimes referred to as “Terrans,” are a warp-capable humanoid species from Earth in the Sol system. After Earth’s 21st‑century conflicts, Humanity’s recovery and rapid technological growth culminated in the Phoenix’s first warp flight and historic first contact with Vulcans in 2063. In the 22nd century, Earth unified under a single planetary authority (United Earth), expanded through exploration and settlement, and became a driving force behind the interstellar cooperation that led to the United Federation of Planets—founded on Earth in 2161.",
    "biology": "Humans are warm‑blooded, bilaterally symmetrical, bipedal primates with two hands and two feet, each typically having five digits. By the 22nd century, average Human lifespan had extended to roughly a century, and by the mid‑24th century it was common for Humans to live to 120+; Dr. Leonard McCoy is noted as having lived to at least 137. Humans are generally not as physically strong as some species (e.g., Vulcans or Klingons) but are notably resilient and adaptable. Human DNA is compatible—with appropriate conditions/modifications—with several other humanoid species, and successful Human hybrids are known (including with Vulcans, Betazoids, and Klingons).",
    "society": "Human civilization is culturally diverse and highly adaptive, with wide variation across Earth and its colonies. Human society is repeatedly characterized by a strong drive to explore, innovate, and cooperate—traits that helped Humans become a major presence in Starfleet and Federation colonization efforts. Canon sources describe Human culture as having evolved to eliminate war, poverty, and disease by 2113. Politically, the 22nd century saw Earth’s unification under United Earth and the development of Earth‑origin institutions (including Starfleet’s precursors) that later integrated into Federation structures.",
    "capabilities": "Humans are often described as ‘average’ in raw physical and technological terms compared to many peers, but they excel in flexibility, innovation, and cross‑cultural collaboration. Humans display efficient thermoregulation (notably sweating) that supports endurance across varied climates. Limited evidence suggests some marginal extrasensory perception (e.g., rare telepaths), though such abilities are uncommon and historically controversial.",
    "relations": "Humans maintain close ties with Vulcans following first contact in 2063 and later partnered with Vulcan, Andoria, and Tellar in founding the United Federation of Planets in 2161. Across multiple eras, Humans and the Federation face major geopolitical and existential conflicts involving the Klingon Empire, Romulan Star Empire, the Borg Collective, and the Dominion. The Borg designate Humans as “Species 5618.” Human-led Starfleet exploration and diplomacy frequently place Humans at the center of first-contact events, alliances, and interstellar crises.",
    "notableIndividuals": [
      "Zefram Cochrane",
      "Jonathan Archer",
      "James T. Kirk",
      "Jean-Luc Picard",
      "Benjamin Sisko",
      "Kathryn Janeway",
      "Leonard McCoy",
      "Beverly Crusher"
    ],
    "keyAppearances": [
      "Star Trek: First Contact (first contact with Vulcans, 2063)",
      "ENT: \"Broken Bow\" (Human-led early Starfleet era)",
      "TNG: \"The Chase\" (shared humanoid ancestry/seeding)",
      "DS9: \"The Siege of AR-558\" (perspective on Human nature under stress)",
      "VOY: \"Dark Frontier\" (Borg designation for Humans)",
      "VOY: \"Distant Origin\" (Voth and Earth-origin context)",
      "TNG: \"Encounter at Farpoint\" (McCoy longevity reference)"
    ],
    "imageUrl": ""
  },
  {
    "id": "jem-hadar",
    "name": "Jem'Hadar",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "klingons",
    "name": "Klingons",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "romulans",
    "name": "Romulans",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "species-8472",
    "name": "Species 8472",
    "type": "Extra-dimensional non-humanoid species (Borg designation)",
    "quadrant": "Fluidic space (extra-dimensional); incursions into the Delta Quadrant",
    "homeworld": "Fluidic space",
    "affiliations": [],
    "firstAppearance": "VOY: \"Scorpion\" (2373)",
    "overview": "Species 8472 is the Borg Collective’s designation for an extra-dimensional, non-humanoid species native to a realm called fluidic space, reached through quantum singularities. When the Borg attempted to invade fluidic space to assimilate 8472’s advanced biology, the species proved immune to assimilation and responded with devastating counterattacks.\n\nPossessing highly developed organic technology and an unusually robust physiology, Species 8472 was treated by the Borg as the “apex of biological evolution.” After repelling the Borg, 8472 launched a campaign into the galaxy that targeted the Collective and, at times, threatened other civilizations that were caught in the crossfire. Voyager’s involvement—first in helping develop a weapon that could kill 8472, then later in negotiating a cease-fire—shaped the species’ view of the Federation as a potential threat.",
    "biology": "In its native form, Species 8472 stands roughly three meters tall and is tripedal. Its eyes have cruciform pupils and it lacks obvious external mouths, nostrils, and ears. The species is enormously strong and can cling to surfaces and function without an oxygen atmosphere; it appears able to survive without any atmosphere and can operate without gravity.\n\nAt the cellular level, each cell contains vastly more DNA than a human cell; 8472’s DNA is triple-helixed and extremely densely coded. Its immune system is extraordinarily powerful, rapidly destroying foreign chemical, biological, or technological agents—including Borg nanoprobes—making assimilation ineffective. The species is susceptible to a modified form of nanoprobe engineered to evade its immune response and disintegrate its cells.\n\n8472 blood is described as consisting of DNA and polyfluidic compounds. Their bodies generate a bioelectric field that interferes with sensors and transporter locks, and they can endure weapon impacts that would be fatal to most lifeforms. Even when severely injured, individuals have demonstrated significant regenerative capability.",
    "society": "As the only known inhabitants of fluidic space, Species 8472 is intensely xenophobic and views other lifeforms as genetically “impure” and inherently threatening. Following the Borg incursion into their realm, 8472 characterized the Milky Way as a source of contamination and sought to purge life from the galaxy.\n\nAfter conflict with Voyager, the species reassessed priorities: rather than focusing solely on the Borg, it began treating the Federation—especially Humanity and Starfleet—as the greater danger because of Voyager’s bio-molecular weapon. To prepare, 8472 built “terraspheres” in the Delta Quadrant (large simulated environments) and genetically modified itself to resemble Alpha Quadrant species, conducting reconnaissance aimed at possible infiltration of Earth.\n\nDuring these simulated operations, some members developed curiosity—and even appreciation—for humanoid culture, including Federation art, literature, and music, complicating the species’ prior absolutism.",
    "capabilities": "Species 8472 combines extreme biological resilience with advanced organic technology. Their bio-ships are heavily resistant to conventional weapons and their weapons systems can penetrate Borg shielding. Individuals can breach force fields, resist most technological interference, and mask themselves from sensors through their bioelectric field.\n\nCommunication is primarily telepathic in native form. Documented contacts show 8472 initiating mental communication with telepathic species, though such contact can be physically taxing for recipients. Beyond telepathy, 8472 demonstrated sophisticated bioengineering, including genetic modification to mimic other species and construction of elaborate simulated environments for training and intelligence-gathering.",
    "relations": "Borg–8472 conflict began in 2373 when the Collective opened portals into fluidic space and attempted assimilation, triggering a violent war in which 8472 destroyed Borg ships and planets and threatened broader Delta Quadrant stability. Voyager allied with the Borg to stop the incursion and deployed bio-molecular warheads containing modified nanoprobes that forced 8472 to withdraw to fluidic space.\n\nThat weapon led 8472 to treat Starfleet as a future adversary. In 2375, however, Voyager made contact with 8472’s infiltration operation and negotiated a cease-fire: Voyager offered the modified nanoprobes in exchange for data on 8472 technology, and the species returned to fluidic space.\n\nIndividual encounters continued to reveal the species’ danger and complexity, including a member hunted by Hirogen and a later willingness (in at least some factions) to reconsider blanket hostility toward the Federation.",
    "notableIndividuals": [
      "“Valerie Archer” (Species 8472 in humanoid disguise, Terrasphere 8)",
      "Unnamed member that contacted Kes telepathically (VOY: \"Scorpion\")",
      "Unnamed member hunted by Hirogen (VOY: \"Prey\")"
    ],
    "keyAppearances": [
      "VOY: \"Scorpion\"",
      "VOY: \"Scorpion, Part II\"",
      "VOY: \"The Gift\"",
      "VOY: \"Prey\"",
      "VOY: \"In the Flesh\""
    ],
    "imageUrl": ""
  },
  {
    "id": "tellarites",
    "name": "Tellarites",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "trill",
    "name": "Trill",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "vorta",
    "name": "Vorta",
    "type": "",
    "quadrant": "",
    "homeworld": "",
    "affiliations": [],
    "firstAppearance": "",
    "overview": "",
    "biology": "",
    "society": "",
    "capabilities": "",
    "relations": "",
    "notableIndividuals": [],
    "keyAppearances": [],
    "imageUrl": ""
  },
  {
    "id": "vulcans",
    "name": "Vulcans",
    "type": "Warp-capable humanoid species",
    "quadrant": "Beta Quadrant (Vulcan sector; ~16 light-years from Sol)",
    "homeworld": "Vulcan (40 Eridani system)",
    "affiliations": [
      "United Federation of Planets (founding member world: Vulcan)",
      "Vulcan High Command (historical 22nd-century governing body)",
      "Vulcan Science Academy",
      "Vulcan diplomatic service"
    ],
    "firstAppearance": "TOS pilot: \"The Cage\" (original pilot)",
    "overview": "Vulcans (sometimes called “Vulcanians”) are a warp-capable humanoid species from the planet Vulcan in the 40 Eridani system. They are renowned for disciplined logic, emotional restraint, and an outwardly stoic demeanor—traits adopted after a violent early history and codified through the teachings of Surak.\n\nAs one of Humanity’s earliest major interstellar contacts, Vulcans played a decisive role in Earth’s early spacefaring era after first contact in 2063. Vulcan influence on diplomacy, science, and ethics is woven throughout Starfleet history, and Vulcan became a founding member of the United Federation of Planets.",
    "biology": "Vulcans are physically similar to Humans but typically stronger and more resilient, adapted to a hotter, drier homeworld. They possess copper-based blood (green) and distinct external ears. Vulcans can endure harsher environmental conditions than most Humans and often display elevated strength under stress.\n\nA defining biological cycle is pon farr, an intense mating drive occurring roughly every seven years that can become life-threatening if not resolved through ritual combat or mating. Vulcans also practice katra traditions: a Vulcan may preserve their consciousness/“living spirit” within another mind via a mind meld, especially near death, making Vulcan spirituality and neurology unusually intertwined.\n\nVulcans are naturally telepathic to a limited degree; with training, they can perform complex psionic disciplines including mind melds, memory sharing, and in some cases mental influence or healing techniques.",
    "society": "Modern Vulcan society is shaped by Surak’s reforms and the philosophy of logic, emphasizing emotional mastery, self-discipline, and ethical restraint. Many Vulcans pursue rigorous education and service in scientific, diplomatic, and security institutions; the Vulcan Science Academy is a prominent cultural pillar.\n\nHistorically, Vulcan governance in the 22nd century included the Vulcan High Command, whose policies and doctrinal interpretations were later challenged by reform movements tied to Surak’s original writings. The rediscovery of the Kir'Shara (Surak’s preserved writings) helped catalyze political and cultural realignment within Vulcan society.\n\nVulcan culture also includes formal rites and traditions around bonding and marriage, spiritual discipline (including practices such as Kolinahr for shedding emotion), and a strong norm of privacy—particularly regarding pon farr.",
    "capabilities": "Vulcans are widely respected for a blend of physical capability and mental discipline. Notable skills include telepathic techniques such as the Vulcan mind meld, which can share memories, transfer katras, or probe knowledge with consent (or, in rare circumstances, coercion).\n\nThe Vulcan nerve pinch is a well-known incapacitation technique. Many Vulcans train in martial disciplines and meditation, using focus and breath control to maintain performance under pressure. Their cultural emphasis on logic contributes to strong performance in scientific analysis, strategic planning, and diplomacy, though outsiders sometimes misread their restraint as arrogance or coldness.",
    "relations": "Vulcans maintain deep ties with the Federation and Starfleet and have repeatedly acted as mediators, advisors, and scientific leaders across multiple eras. Their relationship with Humans begins with first contact in 2063 and develops into close cooperation by the 22nd century.\n\nVulcans share ancient ancestry with Romulans; Romulans originated as a Vulcan offshoot that rejected Surak’s path. This connection underlies long-standing tension, secrecy, and political complexity between Vulcan and the Romulan Star Empire.\n\nVulcan interactions with other major powers—Klingons, Cardassians, the Borg, and the Dominion—often place Vulcans in roles that blend ethics with realpolitik, balancing Federation ideals against security threats.",
    "notableIndividuals": [
      "Spock",
      "Sarek",
      "Amanda Grayson (Human spouse of Sarek; key to Vulcan–Human family ties)",
      "T'Pol",
      "Tuvok",
      "Syrran",
      "Soval"
    ],
    "keyAppearances": [
      "TOS: \"The Cage\"",
      "TOS: \"Amok Time\"",
      "TOS: \"Journey to Babel\"",
      "Star Trek III: The Search for Spock",
      "TNG: \"Sarek\"",
      "TNG: \"Unification\" / \"Unification II\"",
      "ENT: \"The Forge\" / \"Awakening\" / \"Kir'Shara\"",
      "VOY: \"Blood Fever\"",
      "VOY: \"Meld\""
    ],
    "imageUrl": ""
  }
]
